Storefront/app/controllers/users/registrations_controller.rb

  def update
    if @user.valid_password?(account_update_params[:current_password])
      if @user.update(account_update_params.except(:current_password))
---
UPDATE "users" SET "email" = 'manueldias@gmail.com', "updated_at" = '2024-11-25 16:23:31.644066' WHERE "users"."id" = 1