Storefront/app/controllers/main_controller.rb

  def index
    @query = Product.ransack(params[:q])
    @products = @query.result.includes(:category).available
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (1, 6, 5)
SELECT "products".* FROM "products" WHERE "products"."category_id" = 1 AND (stock > 0)