Storefront/app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)
    if @product.save
---
INSERT INTO "products" ("name", "description", "price", "stock", "size", "color", "deleted_at", "created_at", "updated_at", "category_id") VALUES ('Atletico Madrid 23/24', 'Camiseta local del atletico de madrid del la temporada 2023/2024', 100000.0, 10, 'Large', 'Rojo/blanco', NULL, '2024-11-26 15:36:59.719131', '2024-11-26 15:36:59.719131', 1) RETURNING "id"

  def update
    if @product.update(product_params)
---
UPDATE "products" SET "stock" = 15, "updated_at" = '2024-11-26 03:22:32.102531' WHERE "products"."id" = 1

  def update_stock

    if @product.update(stock_params)
---
UPDATE "products" SET "stock" = 18, "updated_at" = '2024-11-26 03:34:44.874970' WHERE "products"."id" = 1