Storefront/app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    @query = Product.ransack(params[:q])
    @products = @query.result.includes(:category).active.page(params[:page])

SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1
---
  def update
    ActiveRecord::Base.transaction do
      # Validar que no se eliminen todas las imágenes sin agregar nuevas
      if params[:product][:remove_images].present?
        remaining_images = @product.images.count - params[:product][:remove_images].size
        new_images = params[:product][:images].present? && params[:product][:images].reject(&:blank?).any?

        if remaining_images.zero? && !new_images
          begin
          raise ActiveRecord::Rollback
          rescue ActiveRecord::Rollback => e
            flash.now[:error] = "No puedes eliminar todas las imágenes sin agregar al menos una nueva."
            render :edit, status: :unprocessable_entity # Si hay errores de validación, renderizas
            return # Añades return para evitar que se ejecute el siguiente código
          end
        else
          # Proceder a eliminar las imágenes marcadas
          params[:product][:remove_images].each do |image_id|
            @product.images.find(image_id).purge