Storefront/app/controllers/user_management_controller.rb

  def index
    @users = User.active.where.not(id: current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "username", "phone", "role") VALUES ('admin@gmail.com', '$2a$12$Qxzie2Oqx0ScKLeYyf8sB.CQWHM44wCmtscOSzNP/vF/.43I8yfiK', NULL, NULL, NULL, '2024-11-25 18:04:54.384550', '2024-11-25 18:04:54.384550', 'canguro', '2216786767', 0) RETURNING "id"

  def destroy
    user = User.find(params[:id])

    # Cambiar la contraseña de manera aleatoria
    random_password = SecureRandom.hex(8)  # Genera una contraseña aleatoria
    user.update(password: random_password, password_confirmation: random_password)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
UPDATE "users" SET "encrypted_password" = '$2a$12$xLo7CzdoYBdA3HA1/1lvgudr5ShAVfRCVWBdFMucIk8ofvnflvlBi', "updated_at" = '2024-11-25 19:11:45.850441' WHERE "users"."id" = 2