Storefront/app/views/main/index.html.erb

SELECT "categories".* FROM "categories"
---
        <div class="category-list">
          <%= select_tag 'q[category_id_eq]',
              options_from_collection_for_select(
                Category.all,
                :id,
                :name,
                params.dig(:q, :category_id_eq)
              ),
              prompt: "Todas las categorías",
              class: "category-select" %>