Storefront/app/views/products/index.html.erb

SELECT "products".* FROM "products"
---
        <div class= "product-category-list">
          <%= select_tag 'q[category_id_eq]',
                  options_from_collection_for_select(
                    Category.all,
                    :id,
                    :name,
                    params.dig(:q, :category_id_eq)
                  ),
                  prompt: "Todas las categorías",
                  class: "product-category-select" %>