Storefront/app/views/products/new.html.erb

SELECT "categories".* FROM "categories"
---
    <%= form.label :category, "Categoría" %>
    <%= form.collection_select :category_id, Category.all, :id, :name, prompt: "Selecciona una categoría", required: true %>